# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, PMSFCM, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, PMSFCM, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, PMSFCM, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, PMSFCM, [384]]

head:
  - [ -1, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ]  # 9 input_proj.2
  - [-1, 1, AIFI_LPE, [1024, 8, 400]] # 10
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]  # 11, Y5, lateral_convs.0

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 12
  - [ 5, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ]  # 13 input_proj.1
  - [ [ -2, -1 ], 1, Concat, [ 1 ] ] # 14
  - [ -1, 3, RepC3, [ 256, 0.5 ] ]  # 15, fpn_blocks.0
  - [ -1, 1, Conv, [ 128, 1, 1 ] ]   # 16, Y4, lateral_convs.1

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 17
  - [ 1, 1, SPDConv, [ 128 ] ] # 18
  - [ [ -1, -2, 4 ], 1, Concat, [ 1 ] ] # 19
  - [ -1, 1, CSPFusionKernel, [ ] ] # 20
  - [ -1, 3, RepC3, [ 256, 0.5 ] ] # 21

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 22
  - [ [ -1, 16 ], 1, Concat, [ 1 ] ] # 23
  - [ -1, 3, RepC3, [ 256, 0.5 ] ] # 24

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 25
  - [ [ -1, 11 ], 1, Concat, [ 1 ] ] # 26
  - [ -1, 3, RepC3, [ 256, 0.5 ] ] # 27

  - [ [ 21, 24, 27 ], 1, RTDETRDecoder, [ nc, 256, 300, 4, 8, 3 ] ]  # RTDETRDecoder(P3, P4, P5)